app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY title
---
  def index
    #แยก case ว่าจะแสดงผลเรียงตาม title หรือ release date
    case params[:sortby]||session[:sortby]
    when 'title'
      ordering,@sort = {:order => :title}
      @title = 'hilite'
    when 'release_date'
      ordering,@sort = {:order => :release_date}
      @date ='hilite'
    end
    #นำ array ที่เก็บ rate ไว้มาเก็บไว้ที่ @all_ratings
    @all_ratings = Movie.all_ratings
    #เก็บ parameter rating ที่ user ได้เลือกไว้
    @selectrating = params[:ratings]||session[:ratings]||{}
    #ถ้า @selectrating =={} หมายถึงการเข้าเว็บครั้งแรก ทำการ map rateเข้ากับตัวมันเอง
	if @selectrating == {}
		@selectrating = Hash[@all_ratings.map {|rate| [rate, rate]}]